{
  "basics": {
    "name": "Martin Marchev",
    "label": "Engineering Manager",
    "picture": "https://github.com/marchev.png",
    "email": "martin [at] marchev [dot] org",
    "phone": "+359 889 693 597",
    "website": "https://www.linkedin.com/in/martin-marchev/",
    "summary": "Engineering manager with 4 years of managerial experience. 12 years of experience as a software engineer. Experienced in building self-organized teams and focused on fostering a positive engineering culture.",
    "location": {
      "address": "...",
      "postalCode": "1000",
      "city": "Sofia",
      "countryCode": "BG",
      "region": "Sofia"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Paysafe (Skrill)",
      "position": "Engineering Manager",
      "website": "https://www.skrill.com/",
      "startDate": "Jan 2019",
      "endDate": "Present",
      "summary": "Paysafe provides businesses around the globe with simple integration payment APIs, as well as fraud and risk management services.",
      "highlights": [
        "Lead and develop autonomous teams who own their products and processes end-to-end",
        "Create and foster a culture of continuous improvement, curiosity and collaboration",
        "Drive technical roadmap and direction",
        "Mentor and coach aspiring engineering managers",
        "Talent source and hire qualified engineers"
      ]
    },
    {
      "company": "Prime Holding",
      "position": "Head of Java Development",
      "website": "https://www.primeholding.com/",
      "startDate": "Jan 2018",
      "endDate": "Jan 2019",
      "summary": "Prime Holding is a leading IT solutions provider.",
      "highlights": [
        "Create and maintain an engineering culture by coaching, identifying training needs and establishing industry best practices",
        "Strategy development and team growth planning in accordance with the company's objectives and goals",
        "Research, design and implement performance management processes",
        "Participate in pre-sales activities",
        "Lead technical recruitment"
      ]
    },
    {
      "company": "EPAM",
      "position": "Lead Software Engineer",
      "website": "https://epam.com/",
      "startDate": "Apr 2015",
      "endDate": "Jan 2018",
      "summary": "EPAM is a leading global product development and digital platform engineering services company.",
      "highlights": [
        "Leading a distributed cross-functional team at the Royal Bank of Scotland",
        "Fully transformed the development process and migrated to Lean Kaizen",
        "Pioneered the adoption of microservices-based architecture",
        "Actively participated in establishing software engineering competence at EPAM Bulgaria"
      ]
    },
    {
      "company": "Javelin Group",
      "position": "Lead Software Engineer",
      "website": "http://javelingroup.com",
      "startDate": "Apr 2013",
      "endDate": "Apr 2015",
      "summary": "Javelin Group is a leading provider of omni-channel retail solutions and e-commerce consultancy.",
      "highlights": [
        "Led the implementation and integration of product information management system for Harrods Ltd.",
        "Hybris 4 to Hybris 5 migration of the online store of the largest UK kitchenware retailer",
        "Increased quality and delivery by introducing test and deployment automation"
      ]
    },
    {
      "company": "SEEBURGER AG",
      "position": "Software Engineer",
      "website": "http://www.seeburger.com",
      "startDate": "Mar 2008",
      "endDate": "Apr 2013",
      "summary": "SEEBURGER is a market leader in the B2B sector. The company provides business integration and managed file transfer (MFT) solutions to a wide range of customer sectors.",
      "highlights": [
        "Implemented and supported new and existing functionalities of an in-house data transformations programming language",
        "Designed and implemented a test harness for EDIFACT directory imports",
        "Became part of R&D team working on a new generation data transformation solution"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Prime Tech Talks",
      "position": "Speaker",
      "website": "http://primeholding.com/",
      "startDate": "Mar 2018",
      "endDate": "Mar 2018",
      "summary": "Gave talk under the topic \"Introduction to Reactive Programming with Reactor 3\""
    },
    {
      "organization": "Tech Talks",
      "position": "Speaker",
      "website": "http://techtalks.bg/",
      "startDate": "Jul 2015",
      "endDate": "Jul 2015",
      "summary": "Gave talk under the topic \"Concurrent programming without synchronization\""
    },
    {
      "organization": "EPAM Education Programme",
      "position": "Lecturer",
      "website": "https://epa.ms/education-programme",
      "startDate": "Jul 2016",
      "endDate": "Present",
      "summary": "Participating as lecturer and mentor in EPAM Junior Developers training programme"
    }
  ],
  "education": [
    {
      "institution": "'Paisii Hilendarski' University of Plovdiv",
      "area": "Informatics",
      "studyType": "Bachelor",
      "startDate": "Oct 2005",
      "endDate": "Jul 2009",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "'Acad. Sergey Pavlovich Korolev' High School",
      "area": "Informatics",
      "studyType": "High School",
      "startDate": "Sep 2000",
      "endDate": "Jun 2005",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "",
      "level": "",
      "keywords": [
        "Java SE/EE",
        "Spring Boot",
        "Reactive Programming",
        "TDD (JUnit 5/Mockito/AssertJ)",
        "SQL",
        "Maven",
        "CI/CD pipelines"
      ]
    },
    {
      "name": "",
      "level": "",
      "keywords": [
        "Wildfly Swarm",
        "Hybris",
        "NoSQL (Redis, Cassandra)",
        "Git",
        "ANTLR",
        "Docker & Kubernetes",
        "Linux and bash scripting"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Proficient speaker"
    },
    {
      "language": "Bulgarian",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "",
      "keywords": [
        "Photography",
        "Science"
      ]
    },
    {
      "name": "",
      "keywords": [
        "Philosophy",
        "Boxing"
      ]
    },
    {
      "name": "",
      "keywords": []
    }
  ],
  "references": [
    {
      "name": "Vladimir Natchev, Senior Software Engineering Manager at EPAM",
      "reference": "Martin worked at EPAM Systems for three years as Lead Software Engineer. He was initially responsible for the development of a complex multithreaded system for one of our Investment Banking clients and after demonstrating both strong technical and analytical skills and outstanding organisational capabilities he received the responsibility to lead one of our full stack product-development teams. In his new role he successfully delivered value and often surpassed the expectations while deploying and further improving the right technical process in combination with the realisation of a fully Agile team culture and setup. I am delighted with Martin's performance during his entire employment with EPAM, and I am confident to recommend him to any technology leadership role."
    },
    {
      "name": "Andrew Bailey, former Web Development Producer at Lakeland",
      "reference": "Martin is a great guy to work with both professionally and personally. Martin had a unique ability to see beyond the fog of issues and come up with solid, tactical solutions to drive the project forward. Martin has excellent Java development skills, and is able to grasp complex business logic and translate them into software solutions. I look forward to working with Martin again sometime in the future."
    },
    {
      "name": "Rohit Gogna, former Test Manager at Javelin Group",
      "reference": "It was a pleasure working with Martin whilst he was at Javelin Group. A patient and intelligent professional, Martin delivered to the highest quality and took pride in his work. I would recommend Martin to any company."
    },
    {
      "name": "Veselin Petrov, former QA at Javelin Group",
      "reference": "I've worked together with Martin, in Javelin Group, on a very demanding project to deliver complex E-commerce solution to our client. Martin is great developer and leader. He has really vast technical expertise and is always ready to help and provide support to his team. I believe he will be a valuable asset to any IT team."
    },
    {
      "name": "Martin Atanasov, former Software Engineer at SEEBURGER",
      "reference": "Martin is very bright and capable. At Seeburger he managed to quickly get familiar with and become the expert on an extremely complex project such as the inhouse-built compiler. Even at his early career stages Martin demonstrated good overall grasp of technologies and processes as well as great leadership skills. Additionally, he's very positive and easy-going. I'd love to work with him again in the future."
    }
  ]
}
